; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-10)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(free left)
(free right)
(at ball1 rooma)
(at ball2 roomb)
(at ball3 roomb)
(at ball4 roomb)
(at ball5 room3)
(at ball6 room3)
(at ball7 room3)
(at ball8 room4)
(at ball9 room4)
(at ball10 room4)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 roomb)
(at ball6 roomb)
(at ball7 room3)
(at ball8 room3)
(at ball9 room3)
(at ball10 room4)
)
)
)

; plan
1. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 3 of 10
2. (pick ball4 roomb left)
   deleted: (at ball4 roomb) (free left)
   added: (carry ball4 left)
   goals met: 3 of 10
3. (pick ball3 roomb right)
   deleted: (at ball3 roomb) (free right)
   added: (carry ball3 right)
   goals met: 3 of 10
4. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 3 of 10
5. (drop ball3 rooma right)
   deleted: (carry ball3 right)
   added: (at ball3 rooma) (free right)
   goals met: 4 of 10
6. (drop ball4 rooma left)
   deleted: (carry ball4 left)
   added: (at ball4 rooma) (free left)
   goals met: 5 of 10
7. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 5 of 10
8. (pick ball2 roomb left)
   deleted: (at ball2 roomb) (free left)
   added: (carry ball2 left)
   goals met: 5 of 10
9. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 5 of 10
10. (drop ball2 rooma left)
   deleted: (carry ball2 left)
   added: (at ball2 rooma) (free left)
   goals met: 6 of 10
11. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 6 of 10
12. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 6 of 10
13. (pick ball9 room4 left)
   deleted: (at ball9 room4) (free left)
   added: (carry ball9 left)
   goals met: 6 of 10
14. (pick ball8 room4 right)
   deleted: (at ball8 room4) (free right)
   added: (carry ball8 right)
   goals met: 6 of 10
15. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 6 of 10
16. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 6 of 10
17. (drop ball8 room3 right)
   deleted: (carry ball8 right)
   added: (at ball8 room3) (free right)
   goals met: 7 of 10
18. (drop ball9 room3 left)
   deleted: (carry ball9 left)
   added: (at ball9 room3) (free left)
   goals met: 8 of 10
19. (pick ball6 room3 left)
   deleted: (at ball6 room3) (free left)
   added: (carry ball6 left)
   goals met: 8 of 10
20. (pick ball5 room3 right)
   deleted: (at ball5 room3) (free right)
   added: (carry ball5 right)
   goals met: 8 of 10
21. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 8 of 10
22. (drop ball6 roomb left)
   deleted: (carry ball6 left)
   added: (at ball6 roomb) (free left)
   goals met: 9 of 10
23. (drop ball5 roomb right)
   deleted: (carry ball5 right)
   added: (at ball5 roomb) (free right)
   goals met: 10 of 10
